Repository: xyloweb/zntpdate
Catalog: zntpdate/po/*.po
Languages: fr

source: %s No argument for
fr: %s Pas d'argument pour

source: %s Missing parameter after flag -%c
fr: %s paramètre absent après l'option -%c

source: %s Invalid parameter <%s> for flag -%c
fr: %s Paramètre invalide <%s> pour l'option -%c

source: %s Unknown flag: -%c
fr: %s Option inconnue: -%c

source: %s IP address must be not null!
fr: %s L'adresse IP ne peut pas être nulle !

source: %s No IP address specified
fr: %s L'adresse IP n'a pas été spécifiée

source: This tool is like ntpdate but I added a feature to make an offset before set system date and time. It is particulary interesting when your system is configured without TIMEZONE and when you could not set nothing else but GMT0. If you are localized into an European Summer Time zone don't forget to set -E option so than one hour will be automatically added in summer. Usage: zndtpdate [options] host where: host hostname or IP address of NTP server options: .configuration: -o v Specify the NTP version for outgoint packets as the integer version, which can be 1 or 2. The default is 3. This allows ntpdate to be used with older NTP versions. -O[+-]n Offset to add before set date, indicate +/- value. -E Enable automatic correction for the summer time. .verbose/debug: -d Enable the debugging mode, in which zntpdate will go through all the steps, but do not adjust the local clock. -s Divert logging output from the standard output (default) to the system sys- log facility. This is designed primarily for convenience of cron scripts. -v Verbose mode. Information useful for general debugging will also be printed. .help/version: -h Show this command summary. -V Show program version. Examples: How to add automatically 1 hour in winter and 2 hours in summer time? zntpdate -Ev -O+3600 pool.ntp.org How to test znptdate without change date and time of your system? zntpdate -dv pool.ntp.org
fr: Cet outil est identique à ntpdate mais j'ai implémenté une fonctionnalité qui permet d'ajouter un offset en secondes avant de modifier la date et l'heure du système. C'est intéressant lorsque votre système est configuré sans TIMEZONE et en GMT0 alors que, en réalité, vous n'êtes pas en GMT0. Si votre système se trouve dans une zone qui repose sur l'heure d'été, utilisez l'option -E qui ajoutera automatiquement une heure en été. Usage: zndtpdate [options] host où: host le nom du serveur NTP ou son adresse IP options: .configuration: -o v Précise la version du protocole NTP à utiliser, qui peut être 1 ou 2. La valeur par défaut est 3. Cela permet à ntpdate d'être utiliser avec des anciennes version de serveur NTP. -O[+-]n L'offset à ajouter avant de configurer la date et l'heure, indiquez une valeur précédée des signes + ou -. -E Active la correction automatique pour l'heure d'été. .verbeux/debug: -d Activer le mode debug, dans lequel zntpdate affichera l'ensemble de ses actions, mais n'ajustera pas la date et l'heure système. -s Redirige la sortie du log de la sortie standard (par defaut) vers le sys- tème de log. C'est intéressant pour les scripts. -v Mode verbeux. Les informations utiles pour le débug seront également Affichées. .help/version: -h Afficher cette aide sur les commandes de l'outil. -V Afficher la version de l'outil. Exemples: Comment ajouter automatiquement une heure en hiver et deux heures en été ? zntpdate -Ev -O+3600 pool.ntp.org Comment tester zntpdate sans changer la date et l'heure de votre système ? zntpdate -dv pool.ntp.org

source: Written by Jean-Michel Marino (public.jmm@free.fr)
fr: Ecrit par Jean-Michel Marino (public.jmm@free.fr)

source: Try NTP with host: %s
fr: Conexion NTP avec le serveur: %s

source: socket() failed
fr: Echec de la fonction socket()

source: Open socket: %d
fr: Ouverture du socket: %d

source: Try to connect to hostname: '%s' (%s)...
fr: Tentative de connexion à l'hôte: '%s' (%s)...

source: NTP version: %d
fr: Version NTP: %d

source: sigfillset() failed
fr: Echec de la fonction sigfillset()

source: sigaction() failed for SIGALRM
fr: Echec de la fonction sigaction() pour SIGALRM

source: sendto() failed
fr: Echec de la fonction sendto()

source: sendto(): [error %d]
fr: sendto(): [erreur %d]

source: Connected to '%s'
fr: Connecté à '%s'

source: Attempt receive with timeout %ds
fr: Attente de réception avec un délai de %d

source: Timed out, %d more tries...
fr: Délai expiré, %d nouvelle(s) tentative(s)...

source: No Response, %d tries
fr: Pas de réponses, %d tentative(s)

source: recvfrom() failed
fr: Echec de la fonction recvfrom()

source: Cool, I had an response!
fr: Super, j'ai eu une réponse !

source: UNIX time: %ld
fr: Temps UNIX: %ld

source: Time (GMT0): %s
fr: Temps (GMT0): %s

source: EuropeanSummerTime() failed: [error %d]
fr: Echec de la fonction EuropeanSummerTime(): [erreur %d]

source: European Summer Time start at: %s
fr: L'horaire d'été commence le: %s

source: European Summer Time end at : %s
fr: L'horaire d'été finit le: %s

source: EST is activated
fr: L'horaire d'été est activé

source: Time (new) : %s
fr: Nouveau temps: %s

source: System time is %d seconds off
fr: L'heure système est décalée de %d seconde(s)

source: Set time of day is not necessary
fr: L'ajustement de la date et de l'heure n'est pas nécessaire.

source: DEBUG ON: no set time of day activated.
fr: DEBUG ON: l'ajustement n'a pas été réalisé.

source: Set time of day failed !
fr: L'ajustement de la date et de l'heure n'a pas abouti

source: settimeofday() failed, [error %d]: %s
fr: Echec de la fonction settimeofday(), [erreur %d]: %s

source: Set time of day OK
fr: L'ajustement de la date et de l'heure a réussi

source: Close socket: %d
fr: Fermeture de la socket: %d

source: %s trace init failed
fr: %s échec de l'initialisation du journal

source: %s log type not implemented.
fr: %s ce type de journal n'est pas encore implémenté.
