Repository: xyloweb/zntpdate
Catalog: po/*.po
Languages: fr

source: %s No argument for
fr: %s Pas d'argument pour

source: %s Missing parameter after flag -%c
fr: %s param�tre absent apr�s l'option -%c

source: %s Invalid parameter <%s> for flag -%c
fr: %s Param�tre invalide <%s> pour l'option -%c

source: %s Unknown flag: -%c
fr: %s Option inconnue: -%c

source: %s IP address must be not null!
fr: %s L'adresse IP ne peut pas �tre nulle !

source: %s No IP address specified
fr: %s L'adresse IP n'a pas �t� sp�cifi�e

source: Report bugs to <%s>.
fr: Rapportez les bugs � <%s>.

source: Try NTP with host: %s
fr: Conexion NTP avec le serveur: %s

source: socket() failed
fr: Echec de la fonction socket()

source: Open socket: %d
fr: Ouverture du socket: %d

source: Try to connect to hostname: '%s' (%s)...
fr: Tentative de connexion � l'h�te: '%s' (%s)...

source: NTP version: %d
fr: Version NTP: %d

source: sigfillset() failed
fr: Echec de la fonction sigfillset()

source: sigaction() failed for SIGALRM
fr: Echec de la fonction sigaction() pour SIGALRM

source: sendto() failed
fr: Echec de la fonction sendto()

source: sendto(): [error %d]
fr: sendto(): [erreur %d]

source: Connected to '%s'
fr: Connect� � '%s'

source: Attempt receive with timeout %ds
fr: Attente de r�ception avec un d�lai de %d

source: Timed out, %d more tries...
fr: D�lai expir�, %d nouvelle(s) tentative(s)...

source: No Response, %d tries
fr: Pas de r�ponses, %d tentative(s)

source: recvfrom() failed
fr: Echec de la fonction recvfrom()

source: Cool, I had an response!
fr: Super, j'ai eu une r�ponse !

source: UNIX time: %ld
fr: Temps UNIX: %ld

source: Time (GMT0): %s
fr: Temps (GMT0): %s

source: EuropeanSummerTime() failed: [error %d]
fr: Echec de la fonction EuropeanSummerTime(): [erreur %d]

source: European Summer Time start at: %s
fr: L'horaire d'�t� commence le: %s

source: European Summer Time end at : %s
fr: L'horaire d'�t� finit le: %s

source: EST is activated
fr: L'horaire d'�t� est activ�

source: Time (new) : %s
fr: Nouveau temps: %s

source: System time is %d seconds off
fr: L'heure syst�me est d�cal�e de %d seconde(s)

source: Set time of day is not necessary
fr: L'ajustement de la date et de l'heure n'est pas n�cessaire.

source: DEBUG ON: no set time of day activated.
fr: DEBUG ON: l'ajustement n'a pas �t� r�alis�.

source: Set time of day failed !
fr: L'ajustement de la date et de l'heure n'a pas abouti

source: settimeofday() failed, [error %d]: %s
fr: Echec de la fonction settimeofday(), [erreur %d]: %s

source: Set time of day OK
fr: L'ajustement de la date et de l'heure a r�ussi

source: Close socket: %d
fr: Fermeture de la socket: %d

source: %s trace init failed
fr: %s �chec de l'initialisation du journal

source: %s log type not implemented.
fr: %s ce type de journal n'est pas encore impl�ment�.
